tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/ip/mac/mac_frame.h
#define MAC_P2P_ACTION_NOA_SUBTYPE          0

#define MAC_SELF_PROT_ACTION_CAPA_OFT     2
#define MAC_SELF_PROT_ACTION_CAPA_LEN     2
#define MAC_SELF_PROT_ACTION_AID_OFT      4
#define MAC_SELF_PROT_ACTION_AID_LEN      2

/* See IEEE 802.1H for LLC/SNAP encapsulation/decapsulation */
/* Ethernet-II snap header (RFC1042 for most EtherTypes) */
#define FRAME_BODY_LLC_H 0x0003AAAA
#define FRAME_BODY_LLC_L 0x0D890000
#define PAYLOAD_TYPE_TDLS 0x02

#define MAC_ENCAPSULATED_LLC_H_OFT  0
#define MAC_ENCAPSULATED_LLC_L_OFT  4
#define MAC_ENCAPSULATED_PAYLOAD_TYPE_OFT  8
#define MAC_ENCAPSULATED_PAYLOAD_OFT  9

/*
****************************************************************************************
****************************************************************************************
*----------------------- WMM_AC FRAMES AND VALUES DESCRIPTIONS -------------------------
****************************************************************************************
****************************************************************************************
*/

/*
*---------------------------------------------------------------------------------------
*---------------------------------WMM-AC fields offsets---------------------------------
*---------------------------------------------------------------------------------------
*/

#define MAC_WMMAC_OUI_BYTE                              0x00
#define MAC_WMMAC_OUI_TYPE_BYTE                         0x50
#define MAC_WMMAC_OUI_SUBTYPE_BYTE                      0xF2

/* TSPEC field offsets
*--------------------------------------------------------------------------------------*/
#define MAC_WMMAC_TSPEC_HDR_OFT                         0
#define MAC_WMMAC_TSPEC_TSINFO_OFT                      8
#define MAC_WMMAC_TSPEC_NOM_MSDU_SIZE_OFT              11
#define MAC_WMMAC_TSPEC_MAX_MSDU_SIZE_OFT              13
#define MAC_WMMAC_TSPEC_MINSI_OFT                      15
#define MAC_WMMAC_TSPEC_MAXSI_OFT                      19
#define MAC_WMMAC_TSPEC_INACTIVITY_INTERVAL_OFT        23
#define MAC_WMMAC_TSPEC_SUSPENSION_INTERVAL_OFT        27
#define MAC_WMMAC_TSPEC_SERVICE_START_TIME_OFT         31
#define MAC_WMMAC_TSPEC_MIN_DATA_RATE_OFT              35
#define MAC_WMMAC_TSPEC_MEAN_DATA_RATE_OFT             39
#define MAC_WMMAC_TSPEC_PEAK_DATA_RATE_OFT             43
#define MAC_WMMAC_TSPEC_BURST_SIZE_OFT                 47
#define MAC_WMMAC_TSPEC_DELAY_BOUND_OFT                51
#define MAC_WMMAC_TSPEC_MIN_PHY_RATE_OFT               55
#define MAC_WMMAC_TSPEC_SURPLUS_BW_OFT                 59
#define MAC_WMMAC_TSPEC_MEDUIM_TIME_OFT                61

/* TSINFO field offsets
*--------------------------------------------------------------------------------------*/
#define MAC_WMMAC_TSINFO_HDR_OFT                        0
#define MAC_WMMAC_TSINFO_BODY_OFT                       8

/* TSDELAY field offsets
*--------------------------------------------------------------------------------------*/
#define MAC_WMMSA_TSDELAY_HDR_OFT                       0
#define MAC_WMMSA_TSDELAY_BODY_OFT                      8
/*
*---------------------------------------------------------------------------------------
*---------------------------------WMM-AC fields subtypes--------------------------------
*---------------------------------------------------------------------------------------
*/


#define MAC_WMMAC_OUI_SUBTYPE_TSPEC_LEN                 61


#define MAC_OUI_SUBTYPE_WMMAC_TSINFO_LEN                9

// Used by the unit test of the WMM-AC
#define MAC_OUI_SUBTYPE_WMMAC_TSDELAY_LEN              10

// Bit position for TSPEC info field
#define MAC_TSPEC_TRAFIC_TYPE_OFT                        0
#define MAC_TSPEC_TRAFIC_TYPE_MASK                       (CO_BIT(0))

#define MAC_TSPEC_TSID_OFT                               1
#define MAC_TSPEC_TSID_MASK                              (CO_BIT(1)|CO_BIT(2)|CO_BIT(3)|CO_BIT(4))

#define MAC_TSPEC_DIRECTION_OFT                          5
#define MAC_TSPEC_DIRECTION_MASK                         (CO_BIT(5)|CO_BIT(6))

#define MAC_TSPEC_ACCESS_POLICY_OFT                      7
#define MAC_TSPEC_ACCESS_POLICY_MASK                     (CO_BIT(7)|CO_BIT(8))

#define MAC_TSPEC_AGGREGATION_OFT                        9
#define MAC_TSPEC_AGGREGATION_MASK                       (CO_BIT(9))

#define MAC_TSPEC_APSD_OFT                               10
#define MAC_TSPEC_APSD_MASK                              (CO_BIT(10))

#define MAC_TSPEC_USER_PRIORITY_OFT                      11
#define MAC_TSPEC_USER_PRIORITY_MASK                     (CO_BIT(11)|CO_BIT(12)|CO_BIT(13))

#define MAC_TSPEC_ACK_POLICY_OFT                         14
#define MAC_TSPEC_ACK_POLICY_MASK                        (CO_BIT(14)|CO_BIT(15))

#define MAC_TSPEC_SCHEDULE_OFT                           16
#define MAC_TSPEC_SCHEDULE_MASK                          (CO_BIT(16))

/*
*---------------------------------------------------------------------------------------
*---------------------------------WMM-AC Status Codes-----------------------------------
*---------------------------------------------------------------------------------------
*/
#define MAC_WMMAC_ST_ADDTS_SUCESS                      0
#define MAC_WMMAC_ST_DELTS_POOR_CHANNEL_COND          34
#define MAC_WMMAC_ST_ADDTS_REQUEST_DECLINED           37
#define MAC_WMMAC_ST_ADDTS_INVALID_PARAMETERS         38
#define MAC_WMMAC_ST_ADDTS_REJ_W_SUG_CHANGES          39
#define MAC_WMMAC_ST_ADDTS_REJ_W_DELAY_PRD            47

/*
*---------------------------------------------------------------------------------------
*---------------------------------WMM-AC Reason Codes-----------------------------------
*---------------------------------------------------------------------------------------
*/
#define MAC_WMMAC_RS_DELTS_QSTA_LEAVING               36
#define MAC_WMMAC_RS_DELTS_END_TS                     37
#define MAC_WMMAC_RS_DELTS_UNKOWN_TS                  38
#define MAC_WMMAC_RS_DELTS_TIMEOUT                    39
#define MAC_WMMAC_RS_DELTS_UNSPECIFIED                32


